In [4]:
import pandas as pd

import numpy as np

In [7]:
xlsx = pd.read_excel('data.xlsx')

xlsx

,计算机科学与技术学院 网络工程 专业 2017级 学生学籍卡(大类转入) 班级： 学号： 姓名： （学位：工科学士学位） 毕业最低标准：A学分：必修118分，选修35分，共计153学分 B学分：必修7学分。 学位（工科学士）：完成规定学分要求；毕业设计（论文）合格；体侧合格；平均学分积点2.0及其以上；没有考试作弊、论文抄袭等行为；未受过留校察看及以上处分。,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,A 学分（153）,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,必修课程学分情况,NaN,NaN,NaN,NaN,获得学分,NaN,选修课程学分情况,NaN,NaN,NaN,NaN,NaN,获得学分
2,学期,课程名称,学分,成绩,绩点,NaN,NaN,学期,课程名称,N选M,学分,成绩,绩点,NaN
3,"1,2",大学英语2,4,NaN,NaN,NaN,NaN,4,操作系统,1选1,3,NaN,NaN,NaN
4,1或2,大学英语1或大学英语3,4,NaN,NaN,NaN,NaN,4,面向对象程序设计-C++,至少选3分,3,NaN,NaN,NaN
5,1,大学体育1,1,NaN,NaN,NaN,NaN,4,面向对象程序设计-Java,NaN,3,NaN,NaN,NaN
6,1,思想道德修养与法律基础,3,NaN,NaN,NaN,NaN,5,汇编语言程序设计,至少选6分,2,NaN,NaN,NaN
7,1,高等数学A（上）,5.5,NaN,NaN,NaN,NaN,6,网络系统设计与集成,NaN,2,NaN,NaN,NaN
8,1,线性代数A,3,NaN,NaN,NaN,NaN,6,微机原理与接口技术,NaN,2,NaN,NaN,NaN
9,1,计算机科学导论,2,NaN,NaN,NaN,NaN,6,网络安全B,NaN,2,NaN,NaN,NaN
10,1,C语言程序设计,4,NaN,NaN,NaN,NaN,7,嵌入式系统设计B,NaN,2,NaN,NaN,NaN
11,1,大学计算机应用实践,1,NaN,NaN,NaN,NaN,5,.net程序设计,至少选6分,2,NaN,NaN,NaN
12,2,C程序设计能力测评,1,NaN,NaN,NaN,NaN,5,数据挖掘基础B,NaN,2,NaN,NaN,NaN
13,2,大学体育2,1,NaN,NaN,NaN,NaN,5,算法分析与设计C,NaN,2,NaN,NaN,NaN
14,2,形势与政策,0,NaN,NaN,NaN,NaN,6,WEB动态网页设计,NaN,2,NaN,NaN,NaN
15,2,马克思主义基本原理概论,3,NaN,NaN,NaN,NaN,6,智能终端软件开发技术,NaN,2,NaN,NaN,NaN
16,2,高等数学A（下）,5.5,NaN,NaN,NaN,NaN,7,计算机与智能科学前沿,NaN,1,NaN,NaN,NaN
17,2,离散数学A,4,NaN,NaN,NaN,NaN,其他英语课程,NaN,至少选4分,NaN,NaN,NaN,NaN
18,2,大学物理B（上）,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,2,大学物理实验B（上）,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,3,体育（俱乐部）,0.5,NaN,NaN,NaN,NaN,培养方案的限选课程中，人文课程必须大于等于5学分，四年的每个学期均可在全校开出的人文课程中选修,NaN,NaN,NaN,NaN,NaN,NaN
21,3,形势与政策,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,3,大学物理B（下）,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,3,大学物理实验B（下）,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
24,3,概率论与数理统计,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,3,数字与逻辑电路基础,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,3,电路与模拟电子技术B,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27,3,数字电路与逻辑设计实验A,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28,3,数据结构,4.5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29,3,认识实习,1,NaN,NaN,NaN,NaN,个性化教育（跨专业选修课和创新创业拓展项目一共至少修读8学分，其中创新创业拓展项目至少 3学分）,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
44,6,毛泽东思想和中国特色社会主义理论体系概论,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
45,6,课程设计（网络协议分析）,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
46,6,网络规划与设计,3.5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47,6,网络协议分析,3.5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
48,7,形势与政策,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
49,7,毕业实习,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50,7,网络工程综合实践,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
51,8,毕业设计（论文）,12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
52,要求修满,NaN,118,NaN,NaN,NaN,NaN,要求修满(同时满足结构学分),NaN,NaN,35,NaN,NaN,NaN
53,B 学分,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
54,必修模块,NaN,NaN,NaN,NaN,获得学分,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
55,学期,课程名称,学分,成绩,绩点,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
56,1~7,适应性教育,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
57,1~7,课外阅读与讲座报告（每学年至少读2本课外书籍并撰写读书报告；每学年至少听两场学习或学院组织的...,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
58,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
60,1,健康教育1,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
61,1,军事理论课（含军训）,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
62,3,大学生职业发展与就业指导1,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
63,4,健康教育2,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64,6,大学生职业发展与就业指导2,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
65,6,志愿服务于实践体验（1.每学期至少参加一次志愿服务活动；2.参与“三下乡”社会实践、生涯人物...,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
66,要求修满,NaN,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
67,授位情况审查（学院填写）,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
68,毕业获得学分合计,NaN,NaN,NaN,学分,绩点,NaN,其他与学位相关内容的获得情况,NaN,NaN,NaN,NaN,学分,绩点
69,必修课程,NaN,A学分,NaN,NaN,NaN,NaN,必修模块,NaN,B学分,NaN,NaN,NaN,NaN
70,NaN,NaN,NaN,NaN,NaN,NaN,NaN,选修模块,NaN,NaN,NaN,NaN,NaN,NaN
71,选修课程,NaN,NaN,NaN,NaN,NaN,NaN,体侧成绩,NaN,NaN,NaN,NaN,NaN,NaN
72,NaN,NaN,NaN,NaN,NaN,NaN,NaN,英语过级情况,NaN,NaN,NaN,NaN,NaN,NaN
73,合计,NaN,NaN,NaN,NaN,NaN,NaN,留校察看及其以上处分情况,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
# 数据清洗和准备

# 处理缺失数据(利用np.nan创建NaN)
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [18]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [20]:
string_data[0] = None

string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [22]:
# 滤除缺失数据
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])

data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [23]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [25]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.0]])

cleaned = data.dropna()

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [27]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [28]:
data[4] = NA

data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [29]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [31]:
df = pd.DataFrame(np.random.randn(7, 3))

df.iloc[:4, 1] = NA

df.iloc[:2, 2] = NA

df

          0         1         2
0  0.444081       NaN       NaN
1  0.371929       NaN       NaN
2  1.644834       NaN -0.989624
3  0.469213       NaN  0.037145
4  1.420673  1.343848 -0.266838
5 -1.378428  0.539651 -0.518842
6  1.145397 -0.153106  0.349485

In [32]:
df.dropna()

          0         1         2
4  1.420673  1.343848 -0.266838
5 -1.378428  0.539651 -0.518842
6  1.145397 -0.153106  0.349485

In [33]:
df.dropna(thresh=2)

          0         1         2
2  1.644834       NaN -0.989624
3  0.469213       NaN  0.037145
4  1.420673  1.343848 -0.266838
5 -1.378428  0.539651 -0.518842
6  1.145397 -0.153106  0.349485

In [34]:
# 填充缺失数据
df.fillna(0)

          0         1         2
0  0.444081  0.000000  0.000000
1  0.371929  0.000000  0.000000
2  1.644834  0.000000 -0.989624
3  0.469213  0.000000  0.037145
4  1.420673  1.343848 -0.266838
5 -1.378428  0.539651 -0.518842
6  1.145397 -0.153106  0.349485

In [35]:
df.fillna({1: 0.5, 2:0})

          0         1         2
0  0.444081  0.500000  0.000000
1  0.371929  0.500000  0.000000
2  1.644834  0.500000 -0.989624
3  0.469213  0.500000  0.037145
4  1.420673  1.343848 -0.266838
5 -1.378428  0.539651 -0.518842
6  1.145397 -0.153106  0.349485

In [36]:
_ = df.fillna(0, inplace=True)

df

          0         1         2
0  0.444081  0.000000  0.000000
1  0.371929  0.000000  0.000000
2  1.644834  0.000000 -0.989624
3  0.469213  0.000000  0.037145
4  1.420673  1.343848 -0.266838
5 -1.378428  0.539651 -0.518842
6  1.145397 -0.153106  0.349485

In [38]:
df = pd.DataFrame(np.random.randn(6, 3))

df.iloc[2:, 1] = NA

df.iloc[4:, 2 ] = NA

df

          0         1         2
0 -1.011504 -1.284479 -1.791041
1  0.252679  0.829797 -0.221811
2  1.313714       NaN  2.497740
3 -1.014823       NaN -0.618939
4  1.056151       NaN       NaN
5 -0.132906       NaN       NaN

In [39]:
df.fillna(method='ffill')

          0         1         2
0 -1.011504 -1.284479 -1.791041
1  0.252679  0.829797 -0.221811
2  1.313714  0.829797  2.497740
3 -1.014823  0.829797 -0.618939
4  1.056151  0.829797 -0.618939
5 -0.132906  0.829797 -0.618939

In [45]:
df.fillna(method='ffill', limit=4)

          0         1         2
0 -1.011504 -1.284479 -1.791041
1  0.252679  0.829797 -0.221811
2  1.313714  0.829797  2.497740
3 -1.014823  0.829797 -0.618939
4  1.056151  0.829797 -0.618939
5 -0.132906  0.829797 -0.618939

In [47]:
# 数据转换

# 移除重复数据
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4,4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data['v1'] = range(7)

data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [52]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [55]:
# 利用函数或映射进行数据转换
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'Bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8.0, 3.0, 5.0, 6.0]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        Bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [56]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [57]:
lowercased = data['food'].str.lower()

lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [59]:
data['animal'] = lowercased.map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        Bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [62]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [63]:
# 替换值
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [64]:
data.replace(-999, NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [65]:
data.replace([-999, -1000], NA)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [66]:
data.replace({-999: NA, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [68]:
# 重命名轴索引
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', '271'])

data

          one  two  three  271
Ohio        0    1      2    3
Colorado    4    5      6    7
New York    8    9     10   11

In [72]:
transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [74]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  271
Ohio        0    1      2    3
Colorado    4    5      6    7
New York    8    9     10   11

In [76]:
data.rename(index={'Ohio': 'INDIANA'},columns={'three': 'peekaboo'})

          one  two  peekaboo  271
INDIANA     0    1         2    3
Colorado    4    5         6    7
New York    8    9        10   11

In [78]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

data

          one  two  three  271
Ohio        0    1      2    3
Colorado    4    5      6    7
New York    8    9     10   11

In [79]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [80]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [87]:
cats.categories

IntervalIndex([(-3.13, -0.62], (-0.62, -0.012], (-0.012, 0.69], (0.69, 3.85]],
              closed='right',
              dtype='interval[float64]')

In [83]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [84]:
data = np.random.rand(20)

pd.cut(data, 4, precision=2)

[(0.041, 0.25], (0.041, 0.25], (0.47, 0.68], (0.68, 0.89], (0.25, 0.47], ..., (0.47, 0.68], (0.041, 0.25], (0.041, 0.25], (0.47, 0.68], (0.47, 0.68]]
Length: 20
Categories (4, interval[float64]): [(0.041, 0.25] < (0.25, 0.47] < (0.47, 0.68] < (0.68, 0.89]]

In [86]:
data = np.random.randn(1000)

cats = pd.qcut(data, 4, precision=2)

cats

[(-3.13, -0.62], (-0.62, -0.012], (-0.62, -0.012], (-0.62, -0.012], (-0.012, 0.69], ..., (0.69, 3.85], (-0.012, 0.69], (-0.62, -0.012], (0.69, 3.85], (-3.13, -0.62]]
Length: 1000
Categories (4, interval[float64]): [(-3.13, -0.62] < (-0.62, -0.012] < (-0.012, 0.69] < (0.69, 3.85]]

In [90]:
pd.value_counts(cats)

(0.69, 3.85]       250
(-0.012, 0.69]     250
(-0.62, -0.012]    250
(-3.13, -0.62]     250
dtype: int64

In [93]:
vats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

In [94]:
pd.value_counts(vats)

(-0.0117, 1.307]     400
(-1.161, -0.0117]    400
(1.307, 3.854]       100
(-3.118, -1.161]     100
dtype: int64

In [95]:
# 检测和过滤异常值
data = pd.DataFrame(np.random.randn(1000, 4))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001226    -0.012036    -0.000311     0.014027
std       1.053884     0.997091     0.967180     0.988361
min      -3.584694    -2.817914    -3.233948    -3.597377
25%      -0.740881    -0.658969    -0.620469    -0.668271
50%       0.015204     0.018213    -0.033845     0.005061
75%       0.730093     0.646025     0.612291     0.676071
max       3.598663     3.187112     4.436138     2.925187

In [96]:
col = data[2]

In [97]:
col[np.abs(col) > 3]

22     3.026580
244    4.436138
617    3.367072
843   -3.233948
Name: 2, dtype: float64

In [98]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
22  -0.983781  0.119246  3.026580  0.641241
244  0.208173 -0.826009  4.436138  0.863352
380 -1.042517 -1.556236 -0.217130 -3.597377
497 -3.072214  0.033098 -0.938434 -1.875626
617 -0.505895 -1.793764  3.367072  0.620644
651  3.598663  1.402466  0.021344  0.665884
808 -0.661879  3.187112 -0.184628 -0.464410
843 -3.115692 -1.192764 -3.233948  0.514942
994 -3.584694  0.514003 -0.324711 -0.912164

In [99]:
data[np.abs(data) > 3] = np.sign(data) * 3

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001400    -0.012223    -0.001907     0.014625
std       1.049627     0.996507     0.959574     0.986355
min      -3.000000    -2.817914    -3.000000    -3.000000
25%      -0.740881    -0.658969    -0.620469    -0.668271
50%       0.015204     0.018213    -0.033845     0.005061
75%       0.730093     0.646025     0.612291     0.676071
max       3.000000     3.000000     3.000000     2.925187

In [102]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3  1.0 -1.0  1.0  1.0
4  1.0 -1.0  1.0 -1.0

In [103]:
# 排列和随机采样
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [104]:
sampler = np.random.permutation(5)

sampler

array([3, 1, 0, 4, 2])

In [105]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [106]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [111]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3

In [112]:
choices = pd.Series([5, 7, -1, 6, 4])

draws = choices.sample(n=10, replace=True)

draws

0    5
4    4
3    6
3    6
1    7
0    5
4    4
0    5
0    5
1    7
dtype: int64

In [113]:
draws[4]

4    4
4    4
dtype: int64

In [115]:
# 计算指标/哑变量
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'c'],  'data1': range(6)})

pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  0  1

In [116]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   c      5

In [117]:
pd.get_dummies(df['data1'])

   0  1  2  3  4  5
0  1  0  0  0  0  0
1  0  1  0  0  0  0
2  0  0  1  0  0  0
3  0  0  0  1  0  0
4  0  0  0  0  1  0
5  0  0  0  0  0  1

In [138]:
np.random.seed(12345)

In [139]:
values = np.random.rand(10)

In [140]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [141]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [134]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [145]:
# 字符串操作
# 字符串对象方法
val = 'a,b, guido'

pieces = [x.strip() for x in val.split(',')]

pieces

['a', 'b', 'guido']

In [147]:
first, second, third = pieces

first + '::' + second + '::' + third

'a::b::guido'

In [148]:
'::'.join(pieces)

'a::b::guido'

In [149]:
val.index(',')

1

In [150]:
'guido' in val

True

In [151]:
val.find(':')

-1

In [152]:
val.index(':')

ValueError: substring not found

In [153]:
val.count(',')

2

In [154]:
val.replace(',', '::')

'a::b:: guido'

In [155]:
val.replace(',', '::')

'a::b:: guido'

In [157]:
val.rstrip()

'a,b, guido'

In [158]:
# 正则表达式
import re
text = "foo   bar\t baz   \tqux"

re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [159]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [160]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [161]:
m = regex.search(text)

In [162]:
m

In [163]:
print(regex.match(text))

None

In [164]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [166]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

regex = re.compile(pattern, flags=re.IGNORECASE)

In [169]:
m = regex.match('wesm@bright.net')

m.groups()

('wesm', 'bright', 'net')

In [170]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [177]:
# pandas的⽮量化字符串函数
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

data = pd.Series(data)
        
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [178]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [179]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [180]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [181]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [182]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [183]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [184]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [187]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [192]:
data = pd.Series(np.random.randn(9), index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [193]:
data

a  1    0.000940
   2    1.343810
   3   -0.713544
b  1   -0.831154
   3   -2.370232
c  1   -1.860761
   2   -0.860757
d  2    0.560145
   3   -1.265934
dtype: float64

In [191]:
pd.DataFrame(data)

            0
a 1 -0.438570
  2 -0.539741
  3  0.476985
b 1  3.248944
  3 -1.021228
c 1 -0.577087
  2  0.124121
d 2  0.302614
  3  0.523772

In [194]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [195]:
data['b']

1   -0.831154
3   -2.370232
dtype: float64

In [196]:
data['b': 'c']

b  1   -0.831154
   3   -2.370232
c  1   -1.860761
   2   -0.860757
dtype: float64

In [197]:
data.loc[['b', 'd']]

b  1   -0.831154
   3   -2.370232
d  2    0.560145
   3   -1.265934
dtype: float64

In [200]:
data[:, 2]

a    1.343810
c   -0.860757
d    0.560145
dtype: float64

In [201]:
data.unstack()

          1         2         3
a  0.000940  1.343810 -0.713544
b -0.831154       NaN -2.370232
c -1.860761 -0.860757       NaN
d       NaN  0.560145 -1.265934

In [202]:
data.unstack().stack()

a  1    0.000940
   2    1.343810
   3   -0.713544
b  1   -0.831154
   3   -2.370232
c  1   -1.860761
   2   -0.860757
d  2    0.560145
   3   -1.265934
dtype: float64

In [205]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])


frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [206]:
frame.index.names = ['key1', 'key2']

In [207]:
frame.columns.names = ['state', 'color']

In [208]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [209]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [211]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']], names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           codes=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [212]:
# 重排与分级排序
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [213]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [214]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [215]:
# 根据级别汇总统计
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [222]:
# 使⽤DataFrame的列进⾏索引
frame = pd.DataFrame({'a': range(7), 'b': range(7), 'c': ['one', 'one', 'one', 'two','two', 'two', 'two'],
 'd': [0, 1, 2, 0, 1, 2, 3]})

frame

   a  b    c  d
0  0  0  one  0
1  1  1  one  1
2  2  2  one  2
3  3  3  two  0
4  4  4  two  1
5  5  5  two  2
6  6  6  two  3

In [223]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  0  one  0
    1  1  1  one  1
    2  2  2  one  2
two 0  3  3  two  0
    1  4  4  two  1
    2  5  5  two  2
    3  6  6  two  3

In [227]:
# 合并数据集
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})


df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [228]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [229]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [230]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [231]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [232]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'], 'data2': range(5)})

In [233]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [234]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [235]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [237]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'], 'key2': ['one', 'two', 'one'], 'lval': [1, 2, 3]})

In [240]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'], 'key2': ['one', 'one', 'one', 'two'], 'rval': [4, 5, 6, 7]})

In [241]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [242]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [243]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [244]:
# 索引上的合并
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b','c'], 'value': range(6)})

In [245]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [246]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [247]:
right1

   group_val
a        3.5
b        7.0

In [255]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [256]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [259]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'key2': [2000, 2001, 2002, 2001,2002], 'data': np.arange(5.)})

In [261]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'], [2001, 2000, 2000, 2000, 2001, 2002]], columns=['event1', 'event2'])

In [262]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2000   4.0

In [263]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [269]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1
4  Nevada  2000   4.0       2       3

In [270]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [271]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]], index=['a', 'c', 'e', 'f'], columns=['New York', 'Oregon'])

In [272]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [274]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'], columns=['Ohio', 'Nevada'])

In [276]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13., 14.]], index=['b', 'c', 'd', 'e'], columns=['Missouri', 'Alabama'])

In [277]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [278]:
left2.join([right2, another], how='outer')

E:\Anaconda\lib\site-packages\pandas\core\frame.py:6848: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  verify_integrity=True)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

In [280]:
# 轴向链接
arr = np.arange(12).reshape((3, 4))

arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [281]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [282]:
s1 = pd.Series([0, 1], index=['a', 'b'])

s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

s3 = pd.Series([5, 6], index=['f', 'g'])

In [283]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [284]:
pd.concat([s1, s2, s3], axis=1)

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [285]:
s4 = pd.concat([s1, s3])

In [286]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [288]:
pd.concat([s1, s4], axis=1)

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [289]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [290]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b','e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

In [291]:
result = pd.concat([s1, s1, s3], keys=['one','two', 'three'])

In [292]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [293]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [294]:
pd.concat([s1, s2, s3], axis=1, keys=['one','two', 'three'])

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [295]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], columns=['one', 'two'])

In [296]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['three', 'four'])

In [297]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [298]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [299]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
 
df1

          a         b         c         d
0  0.119827 -1.063512  0.332883 -2.359419
1 -0.199543 -1.541996 -0.970736 -1.307030
2  0.286350  0.377984 -0.753887  0.331286

In [300]:
df2

          b         d         a
0  1.349742  0.069877  0.246674
1 -0.011862  1.004812  1.327195

In [301]:
pd.concat([df1, df2], ignore_index=True)

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0  0.119827 -1.063512  0.332883 -2.359419
1 -0.199543 -1.541996 -0.970736 -1.307030
2  0.286350  0.377984 -0.753887  0.331286
3  0.246674  1.349742       NaN  0.069877
4  1.327195 -0.011862       NaN  1.004812

In [302]:
# 合并重叠数据
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], index=['f', 'e', 'd', 'c', 'b', 'a'])

b = pd.Series(np.arange(len(a), dtype=np.float64), index=['f', 'e', 'd', 'c', 'b', 'a'])

In [304]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [305]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [306]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, 5. ])

In [307]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [ ]:
# 重塑层次化索引

In [312]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)), index=pd.Index(['Ohio','Colorado'], columns=pd.Index(['one', 'two', 'three']), name='number'))

In [315]:
data

          0  1  2
number
Ohio      0  1  2
Colorado  3  4  5

In [313]:
result = data.stack()

In [314]:
result

number
Ohio      0    0
          1    1
          2    2
Colorado  0    3
          1    4
          2    5
dtype: int32

In [316]:
result.unstack()

          0  1  2
number
Ohio      0  1  2
Colorado  3  4  5

In [322]:
result.unstack(1)

          0  1  2
number
Ohio      0  1  2
Colorado  3  4  5

In [323]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

data2 = pd.concat([s1, s2], keys=['one', 'two'])

data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [324]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [325]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [326]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [327]:
df = pd.DataFrame({'left': result, 'right': result + 330}, columns=pd.Index(['left', 'right']))

In [328]:
df

            left  right
number
Ohio     0     0    330
         1     1    331
         2     2    332
Colorado 0     3    333
         1     4    334
         2     5    335

In [332]:
# 将“⻓格式”旋转为“宽格式”
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'], 'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

In [333]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [334]:
melted = pd.melt(df, ['key'])

melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [335]:
reshaped = melted.pivot('key', 'variable', 'value')

In [336]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [337]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [338]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [339]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [340]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6